#include "obj_ball.h"


ObjBall::ObjBall() {
	move_dir_ = tnl::Vector2f::Normalize( { speed_, speed_ } ) ;	// 速度に基づいて移動方向を右下に設定
	setPosition( { DXE_WINDOW_WIDTH_HALF, 400.0f } );				// ボールの初期位置（画面中央の少し下）
}

//--------------------------------------------------------------------------------------------------------------------------
// ボールの更新処理
// 位置の更新、壁との反射処理を行う
//--------------------------------------------------------------------------------------------------------------------------
void ObjBall::update() {

	setBeforePosition( getPosition() );

	tnl::Vector2f posiiton = getPosition();

	posiiton += move_dir_ * speed_;         // 現在の移動方向に基づいて位置を更新

	setPosition( posiiton );
}

//--------------------------------------------------------------------------------------------------------------------------
// ボールの描画処理
// 現在位置に四角形でボールを描画する
//--------------------------------------------------------------------------------------------------------------------------
void ObjBall::draw() {
	dxe::DrawBox(getPosition(), radius_, radius_, false, dxe::Colors::DeepPink);  // 四角形（線のみ）で描画
}


//--------------------------------------------------------------------------------------------------------------------------
// ボールの反射処理
//--------------------------------------------------------------------------------------------------------------------------
void ObjBall::reflection( const tnl::Vector2f& surface_normal ) {
	move_dir_ = tnl::Vector2f::Reflection(move_dir_, surface_normal);
}
